In [1]:
import pandas as pd
import numpy as np

In [68]:
se = set([i for i in dir(pd.Series) if not i.startswith("_")])

In [69]:
df = set([i for i in dir(pd.DataFrame) if not i.startswith("_")])

In [70]:
# 시리즈와 데이터 프레임의 공동 메소드를 리스트로 변환
count = 0
tmp = []
for i in (df & se):
    count += 1
    tmp.append(i)
    print(i, end=", ")
    if(count % 4 == 0):
        print()
print(count)

product, rdiv, align, update,
empty, floordiv, memory_usage, round,
to_latex, clip_upper, replace, explode,
sort_values, divide, median, rfloordiv,
var, axes, blocks, to_sql,
infer_objects, to_csv, get_dtype_counts, combine_first,
xs, nsmallest, skew, unstack,
to_pickle, apply, T, add_prefix,
cummax, to_dense, count, add_suffix,
reindex_like, to_period, mean, droplevel,
all, describe, to_sparse, as_matrix,
index, rank, rtruediv, abs,
iteritems, where, cumprod, reindex,
slice_shift, last_valid_index, ndim, to_xarray,
tz_localize, values, duplicated, rename_axis,
expanding, tshift, reset_index, le,
sort_index, head, asfreq, truediv,
kurt, to_msgpack, to_json, kurtosis,
notnull, rolling, sub, radd,
std, between_time, to_clipboard, mode,
rmod, to_timestamp, cov, eq,
to_numpy, combine, sample, shift,
append, isin, aggregate, shape,
bfill, mul, copy, gt,
isnull, prod, to_hdf, isna,
dropna, last, clip_lower, as_blocks,
at, interpolate, compound, cummin,
ffill, mad, loc, tz_convert,
corr, set_axis, at_time, swaplevel,
transpose, any, min, nlargest,
quantile, set_value, ge, drop,
lt, mask, ftypes, asof,
ix, add, pow, ewm,
multiply, subtract, bool, plot,
keys, reorder_levels, to_excel, mod,
squeeze, iloc, to_dict, hist,
sem, pct_change, astype, sparse,
clip, swapaxes, iat, dtypes,
tail, get_value, idxmax, drop_duplicates,
pop, cumsum, idxmin, resample,
pipe, equals, fillna, rmul,
truncate, filter, size, dot,
div, ne, take, sum,
get_ftype_counts, first_valid_index, groupby, transform,
max, rename, rpow, first,
rsub, agg, notna, to_string,
is_copy, get_values, get, items,
diff, nunique, 190

In [74]:
# 1차원 리스트를 2차원 리스트로 변환

def to_matrix(tmp, end):
    return [tmp[i:i+end] for i in range(0, len(tmp), end)]

result = to_matrix(tmp, 5)

In [79]:
df = pd.DataFrame(data=result)
df.head(10)

               0             1                 2              3           4
0        product          rdiv             align         update       empty
1       floordiv  memory_usage             round       to_latex  clip_upper
2        replace       explode       sort_values         divide      median
3      rfloordiv           var              axes         blocks      to_sql
4  infer_objects        to_csv  get_dtype_counts  combine_first          xs
5      nsmallest          skew           unstack      to_pickle       apply
6              T    add_prefix            cummax       to_dense       count
7     add_suffix  reindex_like         to_period           mean   droplevel
8            all      describe         to_sparse      as_matrix       index
9           rank      rtruediv               abs      iteritems       where

In [78]:
df.shape

(38, 5)

In [88]:
df = pd.read_csv('../Pandas/premier_league.csv')
df.head()

,home_team,away_team,home_goals,away_goals,result,season
0,Tottenham Hotspur,Manchester City,0,0,D,2010-2011
1,Aston Villa,West Ham United,3,0,H,2010-2011
2,Blackburn Rovers,Everton,1,0,H,2010-2011
3,Bolton Wanderers,Fulham,0,0,D,2010-2011
4,Sunderland,Birmingham City,2,2,D,2010-2011

In [89]:
premier = df.drop(['season'], axis=1)
premier.head()

           home_team        away_team  home_goals  away_goals result
0  Tottenham Hotspur  Manchester City           0           0      D
1        Aston Villa  West Ham United           3           0      H
2   Blackburn Rovers          Everton           1           0      H
3   Bolton Wanderers           Fulham           0           0      D
4         Sunderland  Birmingham City           2           2      D

In [90]:
premier.dtypes

home_team     object
away_team     object
home_goals     int64
away_goals     int64
result        object
dtype: object

In [91]:
premier + 5

TypeError: can only concatenate str (not "int") to str

In [97]:
premier.head(8)

,home_team,away_team,home_goals,away_goals,result
0,Tottenham Hotspur,Manchester City,3,0,D
1,Aston Villa,West Ham United,6,0,H
2,Blackburn Rovers,Everton,4,0,H
3,Bolton Wanderers,Fulham,3,0,D
4,Sunderland,Birmingham City,5,2,D
5,Wigan Athletic,Blackpool,3,4,A
6,Wolverhampton Wanderers,Stoke City,5,1,H
7,Chelsea,West Bromwich Albion,9,0,H

In [99]:
premier['home_goals'] = premier['home_goals'] + 3

In [100]:
premier.head(8)

,home_team,away_team,home_goals,away_goals,result
0,Tottenham Hotspur,Manchester City,6,0,D
1,Aston Villa,West Ham United,9,0,H
2,Blackburn Rovers,Everton,7,0,H
3,Bolton Wanderers,Fulham,6,0,D
4,Sunderland,Birmingham City,8,2,D
5,Wigan Athletic,Blackpool,6,4,A
6,Wolverhampton Wanderers,Stoke City,8,1,H
7,Chelsea,West Bromwich Albion,12,0,H

In [101]:
premier.dtypes

home_team     object
away_team     object
home_goals     int64
away_goals     int64
result        object
dtype: object

In [104]:
premier.select_dtypes(include=['int64']).head()

   home_goals  away_goals
0           6           0
1           9           0
2           7           0
3           6           0
4           8           2

In [105]:
premier.select_dtypes(include=['number']).head()

   home_goals  away_goals
0           6           0
1           9           0
2           7           0
3           6           0
4           8           2

In [110]:
premier.select_dtypes(include=['object']).head(5)

           home_team        away_team result
0  Tottenham Hotspur  Manchester City      D
1        Aston Villa  West Ham United      H
2   Blackburn Rovers          Everton      H
3   Bolton Wanderers           Fulham      D
4         Sunderland  Birmingham City      D

In [111]:
premier['home_team'].value_counts().head(8)

Manchester City         155
Arsenal                 155
Manchester United       155
Liverpool               155
Tottenham Hotspur       154
Chelsea                 154
Everton                 154
West Bromwich Albion    152
Name: home_team, dtype: int64

In [112]:
premier['home_team'].value_counts(normalize=True).head(8)

Manchester City         0.042257
Arsenal                 0.042257
Manchester United       0.042257
Liverpool               0.042257
Tottenham Hotspur       0.041985
Chelsea                 0.041985
Everton                 0.041985
West Bromwich Albion    0.041439
Name: home_team, dtype: float64

In [116]:
# 중복 확인
premier['result'].duplicated().head(8)

0    False
1    False
2     True
3     True
4     True
5    False
6     True
7     True
Name: result, dtype: bool

In [115]:
# 유일 값 확인
premier['result'].unique()

array(['D', 'H', 'A'], dtype=object)

In [118]:
premier['home_goals'].nlargest(8)

408     14
938     14
1596    14
3474    14
144     13
610     13
955     13
1233    13
Name: home_goals, dtype: int64

In [119]:
premier['home_goals'].nsmallest(8)

0     6
3     6
5     6
16    6
23    6
34    6
38    6
43    6
Name: home_goals, dtype: int64

In [120]:
premier.nlargest(8,'home_goals')

              home_team         away_team  home_goals  away_goals result
408   Manchester United           Arsenal          14           2      H
938             Chelsea       Aston Villa          14           0      H
1596        Southampton        Sunderland          14           0      H
3474  Manchester City           Watford            14           0      H
144   Manchester United  Blackburn Rovers          13           1      H
610             Arsenal  Blackburn Rovers          13           1      H
955             Arsenal  Newcastle United          13           3      H
1233    Manchester City      Norwich City          13           0      H

In [121]:
premier.nsmallest(8,'home_goals')

            home_team         away_team  home_goals  away_goals result
0   Tottenham Hotspur   Manchester City           6           0      D
3    Bolton Wanderers            Fulham           6           0      D
5      Wigan Athletic         Blackpool           6           4      A
16     Wigan Athletic           Chelsea           6           6      A
23  Tottenham Hotspur    Wigan Athletic           6           1      A
34   Newcastle United         Blackpool           6           2      A
38    Birmingham City         Liverpool           6           0      D
43            Everton  Newcastle United           6           1      A

In [125]:
s = set([i for i in dir(pd.Series) if not i.startswith("_")])

In [126]:
d = set([i for i in dir(pd.DataFrame) if not i.startswith("_")])

In [128]:
# 시리즈에만 존재하는 메소드를 리스트로 변환
count = 0
tmp = []
for i in (s - d):
    count += 1
    tmp.append(i)
    print(i, end=", ")
    if(count % 4 == 0):
        print()
print(count)

nbytes, value_counts, to_list, cat,
ptp, argsort, is_monotonic, asobject,
searchsorted, dtype, dt, real,
nonzero, str, base, is_monotonic_increasing,
argmin, tolist, item, map,
factorize, to_frame, view, autocorr,
rdivmod, array, name, strides,
repeat, ftype, valid, data,
argmax, put, is_monotonic_decreasing, from_array,
compress, between, divmod, itemsize,
ravel, unique, flags, is_unique,
imag, hasnans, 46

In [129]:
# 1차원 리스트를 2차원 리스트로 변환

def to_matrix(tmp, end):
    return [tmp[i:i+end] for i in range(0, len(tmp), end)]

result = to_matrix(tmp, 5)

In [132]:
# 데이터 프레임에만 존재하는 메소드를 리스트로 변환
count = 0
tmp = []
for i in (d - s):
    count += 1
    tmp.append(i)
    print(i, end=", ")
    if(count % 4 == 0):
        print()
print(count)

applymap, insert, info, corrwith,
to_gbq, iterrows, columns, merge,
query, pivot_table, melt, itertuples,
select_dtypes, style, stack, to_stata,
boxplot, eval, to_parquet, pivot,
lookup, set_index, from_items, to_feather,
from_records, to_records, to_html, assign,
join, from_dict, 30

In [133]:
# 1차원 리스트를 2차원 리스트로 변환

def to_matrix(tmp, end):
    return [tmp[i:i+end] for i in range(0, len(tmp), end)]

result_Df = to_matrix(tmp, 5)

In [131]:
# 시리즈에만 존재하는 메소드
series = pd.DataFrame(data=result)
series.head(7)

,0,1,2,3,4
0,nbytes,value_counts,to_list,cat,ptp
1,argsort,is_monotonic,asobject,searchsorted,dtype
2,dt,real,nonzero,str,base
3,is_monotonic_increasing,argmin,tolist,item,map
4,factorize,to_frame,view,autocorr,rdivmod
5,array,name,strides,repeat,ftype
6,valid,data,argmax,put,is_monotonic_decreasing

In [134]:
# 데이터 프레임에만 존재하는 메소드
dataframe = pd.DataFrame(data=result_Df)
dataframe.head(7)

            0           1              2           3             4
0    applymap      insert           info    corrwith        to_gbq
1    iterrows     columns          merge       query   pivot_table
2        melt  itertuples  select_dtypes       style         stack
3    to_stata     boxplot           eval  to_parquet         pivot
4      lookup   set_index     from_items  to_feather  from_records
5  to_records     to_html         assign        join     from_dict

In [135]:
se = pd.Series([0,2,4,8,6])
se

0    0
1    2
2    4
3    8
4    6
dtype: int64

In [136]:
re_se = se.rename({0 : 'One', 1 : 'Two', 2 : 'Three', 3 : 'Four', 4 : 'Five'})
re_se

One      0
Two      2
Three    4
Four     8
Five     6
dtype: int64

In [137]:
re_se.reindex(['One','Two','Three','4th','5th'])

One      0.0
Two      2.0
Three    4.0
4th      NaN
5th      NaN
dtype: float64

In [138]:
re_se.reindex(['Three','One','Two',])

Three    4
One      0
Two      2
dtype: int64

In [139]:
se_1 = pd.Series([3,6,9], index=[0,1,2])
se_1

0    3
1    6
2    9
dtype: int64

In [140]:
se_1.index.dtype

dtype('int64')

In [145]:
se_2 = pd.Series([2,4,8], index=list('012'))
se_2

0    2
1    4
2    8
dtype: int64

In [146]:
se_2.index.dtype

dtype('O')

In [147]:
se_1 + se_2

0   NaN
1   NaN
2   NaN
0   NaN
1   NaN
2   NaN
dtype: float64

In [148]:
se_2.index = [0,1,2]

In [149]:
se_1 + se_2

0     5
1    10
2    17
dtype: int64

In [150]:
se_3 = pd.Series([10,20,30], index=list('012'))

In [151]:
se_3 = se_3.rename({'0' : 0, '1' : 1, '2' : 2})

In [152]:
se_1 + se_3

0    13
1    26
2    39
dtype: int64

In [153]:
se_4 =  pd.Series([100,200,300], index=list('012'))

In [154]:
se_4.index.values

array(['0', '1', '2'], dtype=object)

In [155]:
se_4.index = se_4.index.values.astype('int64')

In [156]:
se_1 + se_4

0    103
1    206
2    309
dtype: int64

In [3]:
df = pd.read_csv('../Pandas/premier_league.csv')
df.head()

,home_team,away_team,home_goals,away_goals,result,season
0,Tottenham Hotspur,Manchester City,0,0,D,2010-2011
1,Aston Villa,West Ham United,3,0,H,2010-2011
2,Blackburn Rovers,Everton,1,0,H,2010-2011
3,Bolton Wanderers,Fulham,0,0,D,2010-2011
4,Sunderland,Birmingham City,2,2,D,2010-2011

In [4]:
df.filter(like='goals').head()

   home_goals  away_goals
0           0           0
1           3           0
2           1           0
3           0           0
4           2           2

In [5]:
df.filter(regex='\_').head()

           home_team        away_team  home_goals  away_goals
0  Tottenham Hotspur  Manchester City           0           0
1        Aston Villa  West Ham United           3           0
2   Blackburn Rovers          Everton           1           0
3   Bolton Wanderers           Fulham           0           0
4         Sunderland  Birmingham City           2           2

In [6]:
s = pd.Series([2, np.nan, 6, np.nan])
s

0    2.0
1    NaN
2    6.0
3    NaN
dtype: float64

In [7]:
s.fillna(method='ffill')

0    2.0
1    2.0
2    6.0
3    6.0
dtype: float64

In [8]:
s.fillna(method='pad')

0    2.0
1    2.0
2    6.0
3    6.0
dtype: float64

In [9]:
s.fillna(method='bfill')

0    2.0
1    6.0
2    6.0
3    NaN
dtype: float64

In [10]:
s.fillna(method='backfill')

0    2.0
1    6.0
2    6.0
3    NaN
dtype: float64

In [11]:
df

,home_team,away_team,home_goals,away_goals,result,season
0,Tottenham Hotspur,Manchester City,0,0,D,2010-2011
1,Aston Villa,West Ham United,3,0,H,2010-2011
2,Blackburn Rovers,Everton,1,0,H,2010-2011
3,Bolton Wanderers,Fulham,0,0,D,2010-2011
4,Sunderland,Birmingham City,2,2,D,2010-2011
...,...,...,...,...,...,...
3663,Liverpool,Southampton,4,0,H,NaN
3664,Newcastle United,Norwich City,0,0,D,NaN
3665,Watford,Everton,2,3,A,NaN
3666,West Ham United,Brighton and Hove Albion,3,3,D,NaN
3667,Manchester United,Wolverhampton Wanderers,0,0,D,NaN

In [12]:
# 데이터 프레임 각 열의 누락 값 개수
df.isnull().sum()

home_team       0
away_team       0
home_goals      0
away_goals      0
result          0
season        128
dtype: int64

In [13]:
# 데이터 프레임 전체의 누락 값 개수
df.isnull().sum().sum()

128

In [14]:
df['season'].value_counts(dropna=False).tail()

2012-2013    380
2015-2016    380
2017-2018    380
NaN          128
2019-2020    120
Name: season, dtype: int64

In [15]:
df.fillna(" ", axis=1, inplace=True)

In [18]:
df.isnull().sum()

home_team     0
away_team     0
home_goals    0
away_goals    0
result        0
season        0
dtype: int64

In [19]:
se = pd.Series([2,4,np.nan,8])
se

0    2.0
1    4.0
2    NaN
3    8.0
dtype: float64

In [20]:
se.interpolate()

0    2.0
1    4.0
2    6.0
3    8.0
dtype: float64

In [26]:
dat = [[1,2,3,4],[5,6,7,np.nan],[9,10,11,12],[13,14,15,np.nan],[17,18,19,20]]

In [27]:
df = pd.DataFrame(data=dat)
df

    0   1   2     3
0   1   2   3   4.0
1   5   6   7   NaN
2   9  10  11  12.0
3  13  14  15   NaN
4  17  18  19  20.0

In [28]:
df[3].interpolate()

0     4.0
1     8.0
2    12.0
3    16.0
4    20.0
Name: 3, dtype: float64

In [32]:
df = pd.read_csv('../Pandas/premier_league.csv')
df.head()

,home_team,away_team,home_goals,away_goals,result,season
0,Tottenham Hotspur,Manchester City,0,0,D,2010-2011
1,Aston Villa,West Ham United,3,0,H,2010-2011
2,Blackburn Rovers,Everton,1,0,H,2010-2011
3,Bolton Wanderers,Fulham,0,0,D,2010-2011
4,Sunderland,Birmingham City,2,2,D,2010-2011

In [33]:
df.isnull().sum()

home_team       0
away_team       0
home_goals      0
away_goals      0
result          0
season        128
dtype: int64

In [34]:
result = df.dropna(axis=1)

In [35]:
result.isnull().sum()

home_team     0
away_team     0
home_goals    0
away_goals    0
result        0
dtype: int64

In [36]:
result = df.drop('season', axis=1)

In [37]:
result.isnull().sum()

home_team     0
away_team     0
home_goals    0
away_goals    0
result        0
dtype: int64

In [42]:
arr = np.array([1, np.nan, 3, np.nan, 5, np.nan])

In [44]:
np.isnan(arr)

array([False,  True, False,  True, False,  True])

In [45]:
df.count()

home_team     3668
away_team     3668
home_goals    3668
away_goals    3668
result        3668
season        3540
dtype: int64

In [77]:
df.tail()

,home_team,away_team,home_goals,away_goals,result,season
3663,Liverpool,Southampton,4,0,H,NaN
3664,Newcastle United,Norwich City,0,0,D,NaN
3665,Watford,Everton,2,3,A,NaN
3666,West Ham United,Brighton and Hove Albion,3,3,D,NaN
3667,Manchester United,Wolverhampton Wanderers,0,0,D,NaN

In [78]:
result = df.dropna(axis=0)

In [79]:
result.isnull().sum()

home_team     0
away_team     0
home_goals    0
away_goals    0
result        0
season        0
dtype: int64

In [80]:
result.tail()

,home_team,away_team,home_goals,away_goals,result,season
3535,Southampton,Everton,1,2,A,2019-2020
3536,Tottenham Hotspur,Sheffield United,1,1,D,2019-2020
3537,Liverpool,Manchester City,3,1,H,2019-2020
3538,Manchester United,Brighton and Hove Albion,3,1,H,2019-2020
3539,Wolverhampton Wanderers,Aston villa,2,1,H,2019-2020

In [81]:
df.head()

,home_team,away_team,home_goals,away_goals,result,season
0,Tottenham Hotspur,Manchester City,0,0,D,2010-2011
1,Aston Villa,West Ham United,3,0,H,2010-2011
2,Blackburn Rovers,Everton,1,0,H,2010-2011
3,Bolton Wanderers,Fulham,0,0,D,2010-2011
4,Sunderland,Birmingham City,2,2,D,2010-2011

In [83]:
df['result'].duplicated().head()

0    False
1    False
2     True
3     True
4     True
Name: result, dtype: bool

In [85]:
df['season'].unique()

array(['2010-2011', '2011-2012', '2012-2013', '2013-2014', '2014-2015',
       '2015-2016', '2016-2017', '2017-2018', '2018-2019', '2019-2020',
       nan], dtype=object)

In [87]:
df['result'].drop_duplicates()

0    D
1    H
5    A
Name: result, dtype: object

In [88]:
df['result'].duplicated().head()

0    False
1    False
2     True
3     True
4     True
Name: result, dtype: bool

In [95]:
tmp = pd.DataFrame([[1,2,3,4],[1,2,3,4],[5,6,7,8],[9,10,11,12]])

In [96]:
tmp

   0   1   2   3
0  1   2   3   4
1  1   2   3   4
2  5   6   7   8
3  9  10  11  12

In [97]:
tmp.drop_duplicates(inplace=True)

In [98]:
tmp

   0   1   2   3
0  1   2   3   4
2  5   6   7   8
3  9  10  11  12

In [110]:
se = pd.Series(['a','b','c','d'], dtype='category')
se

0    a
1    b
2    c
3    d
dtype: category
Categories (4, object): [a, b, c, d]

In [111]:
se.shape

(4,)

In [112]:
se.values.categories

Index(['a', 'b', 'c', 'd'], dtype='object')

In [113]:
se.dtype

CategoricalDtype(categories=['a', 'b', 'c', 'd'], ordered=False)

In [114]:
se.loc[4] = 'c'

In [115]:
se

0    a
1    b
2    c
3    d
4    c
dtype: object

In [116]:
ct = pd.Categorical(['a','b','c','d'])

In [117]:
ct

[a, b, c, d]
Categories (4, object): [a, b, c, d]

In [118]:
c = set(dir(ct))

In [119]:
s = set(dir(pd.Series))

In [120]:
count = 0
for i in (c - s):
    if not i.startswith("_"):
        count += 1
        print(i, end=", ")
        if count % 5 == 0:
            print()

rename_categories, as_unordered, set_categories, ordered, take_nd,
remove_categories, is_dtype_equal, from_codes, reorder_categories, categories,
as_ordered, remove_unused_categories, add_categories, set_ordered, check_for_ordered,
codes,

In [121]:
cat = pd.Categorical(['a','b','c','d',np.nan], categories=['b','a','d','c'])

In [123]:
cat.dtype

CategoricalDtype(categories=['b', 'a', 'd', 'c'], ordered=False)

In [124]:
df = pd.DataFrame({'Category' : cat, "se" : ['a','b','c','c',np.nan]})

In [125]:
df

  Category   se
0        a    a
1        b    b
2        c    c
3        d    c
4      NaN  NaN

In [126]:
df.select_dtypes(exclude=['object'])

  Category
0        a
1        b
2        c
3        d
4      NaN

In [127]:
df['Category'][4] = 'c'

In [128]:
df

  Category   se
0        a    a
1        b    b
2        c    c
3        d    c
4        c  NaN

In [129]:
df.loc[5, :] = ['b', 'b']

In [130]:
df

  Category   se
0        a    a
1        b    b
2        c    c
3        d    c
4        c  NaN
5        b    b

In [134]:
df = pd.read_csv('../Pandas/premier_league.csv')
df.head()

,home_team,away_team,home_goals,away_goals,result,season
0,Tottenham Hotspur,Manchester City,0,0,D,2010-2011
1,Aston Villa,West Ham United,3,0,H,2010-2011
2,Blackburn Rovers,Everton,1,0,H,2010-2011
3,Bolton Wanderers,Fulham,0,0,D,2010-2011
4,Sunderland,Birmingham City,2,2,D,2010-2011

In [132]:
result = pd.Categorical(df['result'])

In [133]:
result.categories

Index(['A', 'D', 'H'], dtype='object')

In [135]:
result

[D, H, H, D, D, ..., H, D, A, D, D]
Length: 3668
Categories (3, object): [A, D, H]

In [137]:
df['result'] = df['result'].astype(result.dtype)

In [138]:
df['result'].dtype

CategoricalDtype(categories=['A', 'D', 'H'], ordered=False)

In [139]:
try:
    df['result'][0] = 'Home'
except Exception as e :
    print(e)

Cannot setitem on a Categorical with a new category, set the categories first

In [140]:
df.isnull().sum()

home_team       0
away_team       0
home_goals      0
away_goals      0
result          0
season        128
dtype: int64

In [141]:
df.loc[df['season'].isnull(), 'season'] = df.loc[df['season'].isnull(), 'result']

In [142]:
df.isnull().sum()

home_team     0
away_team     0
home_goals    0
away_goals    0
result        0
season        0
dtype: int64

In [153]:
df['home_goals'].between(0,2).sum()

2918

In [148]:
masking = df['home_goals'].between(0,2)

In [149]:
df['home_result'] = ""

In [150]:
df['home_result'] = pd.Categorical(np.where(masking, '승', '대승'))

In [152]:
df.tail()

,home_team,away_team,home_goals,away_goals,result,season,home_result
3663,Liverpool,Southampton,4,0,H,H,대승
3664,Newcastle United,Norwich City,0,0,D,D,승
3665,Watford,Everton,2,3,A,A,승
3666,West Ham United,Brighton and Hove Albion,3,3,D,D,대승
3667,Manchester United,Wolverhampton Wanderers,0,0,D,D,승

In [154]:
df['home_result'].value_counts()

승     2918
대승     750
Name: home_result, dtype: int64

In [155]:
df['home_result'].dtype

CategoricalDtype(categories=['대승', '승'], ordered=False)